renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_irq_rx/src/r_irq_rx.c
#if IRQ_CFG_USE_IRQ15 == 1
irq_callback p_callback_irq15;
const irq_init_block_t g_irq15_handle =
{
    IRQ_NUM_15,                            /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ15,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ15,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ15,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ15,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq15,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ15.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ15,                   /* I/O port input data bit mask for this IRQ. */
};
#endif
#endif /* definedVECT_ICU_IRQ15 */

static const irq_handle_t s_irq_handles[] =
{
    #if IRQ_CFG_USE_IRQ0 == 1
    /* irq handle */
    (irq_handle_t)&g_irq0_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ1 == 1
    /* irq handle */
    (irq_handle_t)&g_irq1_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ2 == 1
    /* irq handle */
    (irq_handle_t)&g_irq2_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ3 == 1
    /* irq handle */
    (irq_handle_t)&g_irq3_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ4 == 1
    /* irq handle */
    (irq_handle_t)&g_irq4_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ5 == 1
    /* irq handle */
    (irq_handle_t)&g_irq5_handle,
    #else
    NULL,
    #endif
#if defined(VECT_ICU_IRQ7)
    #if IRQ_CFG_USE_IRQ6 == 1
    /* irq handle */
    (irq_handle_t)&g_irq6_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ7 == 1
    /* irq handle */
    (irq_handle_t)&g_irq7_handle,
    #else
    NULL,
    #endif
#endif
#if defined(VECT_ICU_IRQ15)
    #if IRQ_CFG_USE_IRQ8 == 1
    /* irq handle */
    (irq_handle_t)&g_irq8_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ9 == 1
    /* irq handle */
    (irq_handle_t)&g_irq9_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ10 == 1
    /* irq handle */
    (irq_handle_t)&g_irq10_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ11 == 1
    /* irq handle */
    (irq_handle_t)&g_irq11_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ12 == 1
    /* irq handle */
    (irq_handle_t)&g_irq12_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ13 == 1
    /* irq handle */
    (irq_handle_t)&g_irq13_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ14 == 1
    /* irq handle */
    (irq_handle_t)&g_irq14_handle,
    #else
    NULL,
    #endif
    #if IRQ_CFG_USE_IRQ15 == 1
    /* irq handle */
    (irq_handle_t)&g_irq15_handle,
    #else
    NULL,
    #endif
#endif /* definedVECT_ICU_IRQ15 */
};

#if IRQ_CFG_PARAM_CHECKING == 1
static uint8_t s_irq_opened[IRQ_NUM_MAX] = {0};
#endif

/***********************************************************************************************************************
Function definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_IRQ_Open
********************************************************************************************************************//**
 * @brief This function initializes the associated IRQ registers, enables interrupts, and provides the handle for use
 * with other API functions. This function must be called before calling any other API functions.
 * @param[in] irq_number Number of the IRQ to be initialized.
 * @param[in] trigger Enumerated type for trigger type: low level, rising edge, falling edge, both edges.
 * @param[in] priority Enumerated priority level setting for the IRQ.
 * @param[in] phandle Pointer to a location for handle for IRQ. Handle value will be set by this function.
 * @param[in] pcallback Pointer to function called from interrupt.
 * @retval IRQ_SUCCESS: Successful; IRQ initialized
 * @retval IRQ_ERR_BAD_NUM: IRQ number is invalid or unavailable
 * @retval IRQ_ERR_NOT_CLOSED: IRQ currently in operation; Perform R_IRQ_Close() first
 * @retval IRQ_ERR_INVALID_PTR: phandle pointer is NULL
 * @retval IRQ_ERR_INVALID_ARG: An invalid argument value was passed.
 * @retval IRQ_ERR_LOCK: The lock could not be acquired.
 * @details The Open function is responsible for preparing an IRQ for operation. After completion of the Open function
 * the IRQ shall be enabled and ready to service interrupts.
 * This function must be called once prior to calling any other
 * IRQ API functions. Once successfully completed, the status of the selected IRQ will be set to "open". After that this
 * function should not be called again for the same IRQ without first performing a "close" by calling R_IRQ_Close().
 * @note
 * None.
 */
irq_err_t   R_IRQ_Open (irq_number_t     irq_number,
                        irq_trigger_t    trigger,
                        irq_prio_t       priority,
                        irq_handle_t    *phandle,
                        void        (*const pcallback)(void *pargs))
{
    irq_err_t    ret = IRQ_SUCCESS;
    irq_handle_t my_handle;
    uint8_t      ier_index;
    uint8_t      ien_mask;

#if IRQ_CFG_REQUIRE_LOCK == 1
    bool        lock_result = false;
#endif

#if IRQ_CFG_PARAM_CHECKING == 1
    if ((IRQ_NUM_MAX <= irq_number) || (NULL == s_irq_handles[irq_number]))
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (s_irq_opened[irq_number]) /* Check for IRQ already opened. */
    {
        return  IRQ_ERR_NOT_CLOSED;
    }
    if ((trigger & IRQ_TRIGGER_MASK) || (priority > BSP_MCU_IPL_MAX))
    {
        return IRQ_ERR_INVALID_ARG;
    }

    /* check argument phandle, pcallback  */
    if (((NULL == phandle) || (NULL == pcallback)) || (FIT_NO_FUNC == pcallback))
    {
        return IRQ_ERR_INVALID_PTR;
    }
#endif

