renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_irq_rx/src/r_irq_rx.c
#if IRQ_CFG_REQUIRE_LOCK == 1
    /* Attempt to acquire lock for this IRQ. Prevents reentrancy conflict. */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));

    if (false == lock_result)
    {
        return IRQ_ERR_LOCK; /* The open function is currently locked. */
    }
#endif

    /* Save a copy so it can be restored later. */
    ien_temp = ICU.IER[ier_index].BYTE;

    /* Disable interrupt request. */
    ICU.IER[ier_index].BYTE &= (~(handle->ien_bit_mask));

    if (IRQ_CMD_SET_PRIO == cmd)
    {
        /* casting void * type to irq_prio_t* type is valid */
        p_rio_cmd_dat = (irq_prio_t*)pcmd_data;

        #if IRQ_CFG_PARAM_CHECKING == 1
        if ((*p_rio_cmd_dat) > BSP_MCU_IPL_MAX)
        {
            #if IRQ_CFG_REQUIRE_LOCK == 1
            /* Release lock for this IRQ. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));
            #endif
            return IRQ_ERR_INVALID_ARG;
        }
        #endif

        /* Set the interrupt priority level. */
        ICU.IPR[IRQ_IPR_BASE + irq_number].BYTE = (uint8_t)((*p_rio_cmd_dat) & 0x0F);
    }
    else if (IRQ_CMD_SET_TRIG == cmd)
    {
        /* casting void * type to irq_trigger_t* type is valid */
        p_trig_cmd_dat = (irq_trigger_t*)pcmd_data;

        #if IRQ_CFG_PARAM_CHECKING == 1
        if ((*p_trig_cmd_dat) & IRQ_TRIGGER_MASK)
        {
            #if IRQ_CFG_REQUIRE_LOCK == 1
            /* Release lock for this IRQ. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));
            #endif
            return IRQ_ERR_INVALID_ARG;
        }
        #endif

        /* Set the method of detection for the interrupt in the IRQCRi.IRQMD[1:0] bits. */
        ICU.IRQCR[irq_number].BYTE = (uint8_t)(*p_trig_cmd_dat);


        if (IRQ_TRIG_LOWLEV != (*p_trig_cmd_dat))
        {
            /* Clear the corresponding IRn.IR flag to 0 (if edge detection is in use). */
            ICU.IR[IRQ_VECT_BASE + irq_number].BYTE = 0;
        }
    }
    else
    {
        /* Nothing else. New commands would go here. */
    }

    /* Restore original interrupt enable state. */
    ICU.IER[ier_index].BYTE = ien_temp;

#if IRQ_CFG_REQUIRE_LOCK == 1
    /* Release lock for this IRQ. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));
#endif
    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_Control
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: R_IRQ_Close
********************************************************************************************************************//**
 * @brief Fully disables the IRQ designated by the handle.
 * @param[in] handle Handle for the IRQ.
 * @retval IRQ_SUCCESS: Successful; IRQ closed
 * @retval IRQ_ERR_NOT_OPENED: The IRQ has not been opened so closing has no effect.
 * @retval IRQ_ERR_BAD_NUM: IRQ number is invalid or unavailable.
 * @retval IRQ_ERR_INVALID_PTR: A required pointer argument is NULL.
 * @details This function frees the IRQ by clearing its assignment to a port, and disables the associated interrupts.
 * The IRQ handle is modified to indicate that it is no longer in the 'open' state. The IRQ cannot be used again
 * until it has been reopened with the R_IRQ_Open function. If this function is called for an IRQ that is not in the
 * open state then an error code is returned.
 * @note
 * None.
 */
irq_err_t   R_IRQ_Close(irq_handle_t handle)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if (NULL == handle)
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(s_irq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    /* Disable interrupt request. */
    ICU.IER[handle->ier_reg_index].BYTE &= (~(handle->ien_bit_mask));

#if defined(VECT_ICU_IRQ15)
    if (7 >= handle->irq_num) /* IRQs 0-7 share these registers. */
    {
#endif
        /* Disable digital filter.  */
        ICU.IRQFLTE0.BYTE &= (~(handle->ien_bit_mask));
#if defined(VECT_ICU_IRQ15)
    }

    else  /* IRQs 8-15 share these registers. */
    {
        /* Disable digital filter.  */
        ICU.IRQFLTE1.BYTE &= (~(handle->ien_bit_mask));
    }
#endif

#if IRQ_CFG_PARAM_CHECKING == 1
    s_irq_opened[handle->irq_num] = 0;      /* Flag that IRQ has now been closed. */
#endif

    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_Close
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_IRQ_ReadInput
********************************************************************************************************************//**
 * @brief This function reads the current level of the pin assigned to the specified IRQ.
 * @param[in] handle Handle for the IRQ.
 * @param[in] plevel Pointer to location where the input pin state can be returned.
 * @retval IRQ_SUCCESS: Operation successfully completed.
 * @retval IRQ_ERR_NOT_OPENED: The IRQ has not been opened.  Perform R_IRQ_Open() first.
 * @retval IRQ_ERR_BAD_NUM: IRQ number is invalid or unavailable.
 * @retval IRQ_ERR_INVALID_PTR: plevel data pointer or handle is NULL.
 * @details This function reads the current level of the pin assigned to the specified IRQ.
 * This is a realtime read which may indicate a different value than the level that initially triggered an interrupt.
 *  One example use is for cases in which a switch has triggered an interrupt and then needs to be polled for debounce.
 * @note
 * None.
 */
irq_err_t   R_IRQ_ReadInput(irq_handle_t const handle, uint8_t *plevel)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if ((NULL == handle) || (NULL == plevel))
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(s_irq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    /* casting handle * type to uint8_t* type is valid */
    *plevel = (uint8_t)((*handle->p_irq_in_port) & handle->irq_port_bit);

    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_ReadInput
***********************************************************************************************************************/

