renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_irq_rx/src/r_irq_rx.c
/***********************************************************************************************************************
* Function Name: R_IRQ_InterruptEnable
********************************************************************************************************************//**
 * @brief This function enables or disables the ICU interrupt for the specified IRQ.
 * @param[in] handle Handle for the IRQ.
 * @param[in] enable true  = enable the interrupt.\n
 * false = disable interrupt.
 * @retval IRQ_SUCCESS: Operation successfully completed.
 * @retval IRQ_ERR_NOT_OPENED: The IRQ has not been opened.  Perform R_IRQ_Open() first.
 * @retval IRQ_ERR_BAD_NUM: IRQ number is invalid or unavailable.
 * @retval IRQ_ERR_INVALID_PTR: handle is NULL.
 * @details The function enables or disables the ICU interrupt for the IRQ specified by the handle argument.
 * This function is potentially called frequently and is expected to execute quickly.
 * @note
 * None.
 */
irq_err_t   R_IRQ_InterruptEnable(irq_handle_t const handle, bool enable)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if (NULL == handle)
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(s_irq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    if (enable)
    {
        /* Enable interrupt request. */
        ICU.IER[handle->ier_reg_index].BYTE |= handle->ien_bit_mask;
    }
    else
    {
        /* Disable interrupt request. */
        ICU.IER[handle->ier_reg_index].BYTE &= (~(handle->ien_bit_mask));
    }

    /* dummy read to complete pipelining. */
    if (ICU.IER[handle->ier_reg_index].BYTE)
    {
        R_BSP_NOP();
    }

    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_InterruptEnable
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: R_IRQ_GetVersion
********************************************************************************************************************//**
 * @brief This function returns the driver version number at runtime.
 * @return Version number with major and minor version digits packed into a single 32-bit value.
 * @details The function returns the version of this module. The version number is encoded such that the top 2 bytes are
 * the major version number and the bottom 2 bytes are the minor version number.
 * @note
 * None.
 */
uint32_t R_IRQ_GetVersion(void)
{
    uint32_t version_number = 0;

    /* Bring in major version number. */
    version_number = ((uint16_t)IRQ_RX_VERSION_MAJOR) << 16;

    /* Bring in minor version number. */
    version_number |= (uint16_t)IRQ_RX_VERSION_MINOR;
    return version_number;
}
/***********************************************************************************************************************
End of function R_IRQ_GetVersion
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_IRQ_IRClear
********************************************************************************************************************//**
 * @brief This function clears the IR flag for the specified IRQ.
 * @param[in] handle Handle for the IRQ.
 * @retval IRQ_SUCCESS: Operation successfully completed.
 * @retval IRQ_ERR_NOT_OPENED: The IRQ has not been opened.  Perform R_IRQ_Open() first.
 * @retval IRQ_ERR_BAD_NUM: IRQ number is invalid or unavailable.
 * @retval IRQ_ERR_INVALID_PTR: handle is NULL.
 * @details The function clears the IR flag for the IRQ specified by the handle argument.
 * @note
 * The IR flag is cleared only when edge detection is used. \n
 * When the interrupt request destination is the DTC or DMAC, do not write 0 to the IR flag.
 */
irq_err_t   R_IRQ_IRClear(irq_handle_t  const handle)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if (NULL == handle)
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(s_irq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    /* Edge detection */
    if (IRQ_TRIG_LOWLEV != ICU.IRQCR[handle->irq_num].BIT.IRQMD)
    {
        /* Clear the corresponding IRn.IR flag to 0 */
        ICU.IR[IRQ_VECT_BASE + handle->irq_num].BYTE = 0;

        /* Check IR flag */
        if (0 != ICU.IR[IRQ_VECT_BASE + handle->irq_num].BYTE)
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
        
    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_IRClear
***********************************************************************************************************************/

/***********************************************************************************************************************
* Description  : IRQ interrupt handler routines.
***********************************************************************************************************************/
#if IRQ_CFG_USE_IRQ0 == 1
R_BSP_PRAGMA_INTERRUPT (irq0_isr, VECT(ICU, IRQ0))

/***********************************************************************************************************************
* Function Name: irq0_isr
* Description  : IRQ0 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq0_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ0 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if ((FIT_NO_FUNC != (*(g_irq0_handle.p_irq_callback))) && (NULL != (*(g_irq0_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq0_handle.p_irq_callback))((void*)&(g_irq0_handle));
    }
} /* End of function irq0_isr */
#endif

