renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_irq_rx/src/r_irq_rx.c
#if IRQ_CFG_USE_IRQ1 == 1
R_BSP_PRAGMA_INTERRUPT (irq1_isr, VECT(ICU, IRQ1))

/***********************************************************************************************************************
* Function Name: irq1_isr
* Description  : IRQ1 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq1_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ1 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if ((FIT_NO_FUNC != (*(g_irq1_handle.p_irq_callback))) && (NULL != (*(g_irq1_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq1_handle.p_irq_callback))((void*)&(g_irq1_handle.irq_num));
    }
} /* End of function irq1_isr */
#endif

#if IRQ_CFG_USE_IRQ2 == 1
R_BSP_PRAGMA_INTERRUPT (irq2_isr, VECT(ICU, IRQ2))

/***********************************************************************************************************************
* Function Name: irq2_isr
* Description  : IRQ2 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq2_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ2 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if ((FIT_NO_FUNC != (*(g_irq2_handle.p_irq_callback))) && (NULL != (*(g_irq2_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq2_handle.p_irq_callback))((void*)&(g_irq2_handle.irq_num));
    }
} /* End of function irq2_isr */
#endif

#if IRQ_CFG_USE_IRQ3 == 1
R_BSP_PRAGMA_INTERRUPT (irq3_isr, VECT(ICU, IRQ3))

/***********************************************************************************************************************
* Function Name: irq3_isr
* Description  : IRQ3 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq3_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ3 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if ((FIT_NO_FUNC != (*(g_irq3_handle.p_irq_callback))) && (NULL != (*(g_irq3_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq3_handle.p_irq_callback))((void*)&(g_irq3_handle.irq_num));
    }
} /* End of function irq3_isr */
#endif

#if IRQ_CFG_USE_IRQ4 == 1
R_BSP_PRAGMA_INTERRUPT (irq4_isr, VECT(ICU, IRQ4))

/***********************************************************************************************************************
* Function Name: irq4_isr
* Description  : IRQ4 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq4_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ4 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if ((FIT_NO_FUNC != (*(g_irq4_handle.p_irq_callback))) && (NULL != (*(g_irq4_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq4_handle.p_irq_callback))((void*)&(g_irq4_handle.irq_num));
    }
} /* End of function irq4_isr */
#endif

#if IRQ_CFG_USE_IRQ5 == 1
R_BSP_PRAGMA_INTERRUPT (irq5_isr, VECT(ICU, IRQ5))

/***********************************************************************************************************************
* Function Name: irq5_isr
* Description  : IRQ5 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq5_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ5 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if ((FIT_NO_FUNC != (*(g_irq5_handle.p_irq_callback))) && (NULL != (*(g_irq5_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq5_handle.p_irq_callback))((void*)&(g_irq5_handle.irq_num));
    }
} /* End of function irq5_isr */
#endif

#if defined(VECT_ICU_IRQ7)
#if IRQ_CFG_USE_IRQ6 == 1
R_BSP_PRAGMA_INTERRUPT (irq6_isr, VECT(ICU, IRQ6))

/***********************************************************************************************************************
* Function Name: irq6_isr
* Description  : IRQ6 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq6_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ6 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if ((FIT_NO_FUNC != (*(g_irq6_handle.p_irq_callback))) && (NULL != (*(g_irq6_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq6_handle.p_irq_callback))((void*)&(g_irq6_handle.irq_num));
    }
} /* End of function irq6_isr */
#endif

#if IRQ_CFG_USE_IRQ7 == 1
R_BSP_PRAGMA_INTERRUPT (irq7_isr, VECT(ICU, IRQ7))

/***********************************************************************************************************************
* Function Name: irq7_isr
* Description  : IRQ7 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq7_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ7 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if ((FIT_NO_FUNC != (*(g_irq7_handle.p_irq_callback))) && (NULL != (*(g_irq7_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq7_handle.p_irq_callback))((void*)&(g_irq7_handle.irq_num));
    }
} /* End of function irq7_isr */
#endif
#endif /* definedVECT_ICU_IRQ7 */

