renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_irq_rx/src/r_irq_rx.c
#if defined(VECT_ICU_IRQ15)
#if IRQ_CFG_USE_IRQ8 == 1
R_BSP_PRAGMA_INTERRUPT (irq8_isr,VECT(ICU, IRQ8))
/***********************************************************************************************************************
* Function Name: irq8_isr
* Description  : IRQ8 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq8_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ8 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq8_handle.p_irq_callback))) && (NULL != (*(g_irq8_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq8_handle.p_irq_callback))((void*)&(g_irq8_handle.irq_num));
    }
} /* End of function irq8_isr */
#endif

#if IRQ_CFG_USE_IRQ9 == 1
R_BSP_PRAGMA_INTERRUPT (irq9_isr,VECT(ICU, IRQ9))
/***********************************************************************************************************************
* Function Name: irq9_isr
* Description  : IRQ9 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq9_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ9 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq9_handle.p_irq_callback))) && (NULL != (*(g_irq9_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq9_handle.p_irq_callback))((void*)&(g_irq9_handle.irq_num));
    }
} /* End of function irq9_isr */
#endif

#if IRQ_CFG_USE_IRQ10 == 1
R_BSP_PRAGMA_INTERRUPT (irq10_isr,VECT(ICU, IRQ10))
/***********************************************************************************************************************
* Function Name: irq10_isr
* Description  : IRQ10 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq10_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ10 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq10_handle.p_irq_callback))) && (NULL != (*(g_irq10_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq10_handle.p_irq_callback))((void*)&(g_irq10_handle.irq_num));
    }
} /* End of function irq10_isr */
#endif

#if IRQ_CFG_USE_IRQ11 == 1
R_BSP_PRAGMA_INTERRUPT (irq11_isr,VECT(ICU, IRQ11))
/***********************************************************************************************************************
* Function Name: irq11_isr
* Description  : IRQ11 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq11_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ11 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq11_handle.p_irq_callback))) && (NULL != (*(g_irq11_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq11_handle.p_irq_callback))((void*)&(g_irq11_handle.irq_num));
    }
} /* End of function irq11_isr */
#endif

#if IRQ_CFG_USE_IRQ12 == 1
R_BSP_PRAGMA_INTERRUPT (irq12_isr, VECT(ICU, IRQ12))
/***********************************************************************************************************************
* Function Name: irq12_isr
* Description  : IRQ12 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq12_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ12 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq12_handle.p_irq_callback))) && (NULL != (*(g_irq12_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq12_handle.p_irq_callback))((void*)&(g_irq12_handle.irq_num));
    }
} /* End of function irq12_isr */
#endif

#if IRQ_CFG_USE_IRQ13 == 1
R_BSP_PRAGMA_INTERRUPT (irq13_isr, VECT(ICU, IRQ13))
/***********************************************************************************************************************
* Function Name: irq13_isr
* Description  : IRQ13 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq13_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ13 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq13_handle.p_irq_callback))) && (NULL != (*(g_irq13_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq13_handle.p_irq_callback))((void*)&(g_irq13_handle.irq_num));
    }
} /* End of function irq13_isr */
#endif

#if IRQ_CFG_USE_IRQ14 == 1
R_BSP_PRAGMA_INTERRUPT (irq14_isr, VECT(ICU, IRQ14))
/***********************************************************************************************************************
* Function Name: irq14_isr
* Description  : IRQ14 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq14_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ14 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq14_handle.p_irq_callback))) && (NULL != (*(g_irq14_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq14_handle.p_irq_callback))((void*)&(g_irq14_handle.irq_num));
    }
} /* End of function irq14_isr */
#endif

#if IRQ_CFG_USE_IRQ15 == 1
R_BSP_PRAGMA_INTERRUPT (irq15_isr,VECT(ICU, IRQ15))
/***********************************************************************************************************************
* Function Name: irq15_isr
* Description  : IRQ15 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq15_isr(void)
{
#if IRQ_CFG_NESTED_INT_EN_IRQ15 == 1
    /* set bit PSW.I = 1 to allow nested interrupt */
    R_BSP_SETPSW_I();
#endif

    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq15_handle.p_irq_callback))) && (NULL != (*(g_irq15_handle.p_irq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq15_handle.p_irq_callback))((void*)&(g_irq15_handle.irq_num));
    }
}/* End of function irq15_isr */
#endif
#endif /* definedVECT_ICU_IRQ15 */

/***********************************************************************************************************************
end  r_irq_rx.c
***********************************************************************************************************************/
